{
  "version": "0.2.0",
  "notes": "- feat: 重构设置数据获取逻辑，优化语言和主题设置的处理方式，增强代码可读性和维护性\n- feat: 重构主题管理，移除调试日志并优化 RebindableRef 的 rebind 方法\n- feat: 修复主页面标题的渲染顺序，确保语言翻译文本正确显示\n- feat: 引入 RebindableRef 类以增强语言管理，重构本地化支持，更新相关组件以使用新的语言绑定机制\n- feat: Refactor localization handling by introducing localHelper for improved i18n support and code organization; update various components to utilize new localization methods and paths.\n- feat: 为编辑游戏仓库对话框添加删除按钮；更新对话框和设置栏的ID以增强可读性和可维护性\n- feat: 更新本地化支持，添加语言设置保存功能；优化配置加载器，增强主题管理；重构编辑游戏仓库对话框，添加删除功能\n- feat: Refactor setting section data to improve language and theme management, add new settings for mod paths and initialization buttons, and enhance localization support feat: Update updater configuration with new features and improvements, including plugin support and enhanced user experience\n- feat: 添加当前页面状态管理，优化插件加载逻辑；重构配置加载器，更新存储名称；删除冗余插件加载器类型定义\n- feat: 更新英文本地化文件，添加新的插件信息；重构创建游戏仓库对话框，优化配置位置字段；更新游戏仓库部分，确保编辑对话框在有焦点仓库时显示\n- feat: 更新插件加载器，添加外部脚本加载功能；优化插件禁用管理逻辑和配置加载\n- feat(i18n): add English and Chinese localization support with JSON files and i18n setup\n- feat: add plugin system with configuration management\n- feat: 添加左侧多层级索引菜单组件，支持展开/折叠子目录；更新选项卡菜单组件，优化滑块效果\n- feat: 更新仓库管理功能，重构仓库位置引用，优化组件样式和交互体验；添加新组件和功能\n- feat: 更新版本至 0.2.0，优化仓库管理功能和用户界面，修复多个组件的引用和样式问题\n- 0.2.0\n- feat: 添加游戏仓库启动按钮，优化游戏仓库部分的引用和样式\n- feat: 更新编辑仓库功能，修复引用类型赋值问题并优化仓库列表显示；添加新仓库按钮和本地化支持\n- feat: 添加仓库位置错误提示和编辑仓库对话框的相关文本\n- feat: 更新仓库管理功能，添加编辑仓库对话框，优化对话框样式和交互\n- feat: 调整底部细节样式，优化透明度和布局\n- feat: Enhance repository editing functionality and localization support\n- feat: Add new settings for string type in setting bar configuration\n- feat: Implement file dialog functionality with customizable options\n- 完成了dialog\n- feat: 添加对话框组件和路由列表，优化用户导航体验；重构样式和变量管理，支持动态 z-index\n- feat: 添加对话框组件和测试页面，优化用户交互体验；重构样式和变量管理，支持动态 z-index\n- feat: 添加对话框组件，优化用户交互体验；重构样式和动画效果；更新本地化文件，增强多语言支持\n- 修改了卡片的样式\n- feat: 重构水平卡片列表组件，优化鼠标事件绑定，支持拖拽和滚动交互，提升用户体验\n- feat: 添加可拖拽的卡片列表组件，支持水平滚动和焦点管理，优化用户交互体验\n- feat: 添加水平滚动条和节选择器组件，优化用户界面和交互体验\n- feat: Implement draggable card component with animated transitions\n- feat: 添加游戏选择器组件，支持拖拽排序和添加新游戏功能，优化用户体验\n- feat: 优化配置加载器，添加全局配置支持，更新多个组件和样式，增强用户体验\n- feat: 添加版本信息显示和更新检查功能，优化用户体验\n- feat: 更新本地化文件，添加多语言支持和检查更新功能\n- refactor: restructure localization files and update i18n implementation\n- feat: Add new components and styles for improved UI\n- feat: 添加 snack 消息处理功能，支持多语言提示\n- feat: Refactor mod loading and management system\n- feat: 更新版本号至0.1.14，优化配置加载器和唤醒事件逻辑\n- chore: 更新版本号并修改相关配置文件\n- 0.1.14\n- feat: 更新命令行参数处理，优化唤醒事件的发送和接收逻辑\n- feat: 重构配置加载器，优化文件操作功能，添加二进制文件读写和目录管理功能\n- feat: 添加命令行参数支持，更新相关依赖和功能\n- feat: 更新 xx-mod-manager-tauri 版本至 0.1.13\n- chore: 更新版本号并修改相关配置文件\n- 0.1.13\n- feat: 更新版本号至0.1.12，修改相关配置文件以支持新版本\n- feat: 更新版本号至0.1.12，优化目录展示功能，调整更新安装逻辑\n- feat: 添加展示文件和目录的功能，支持在资源管理器中打开指定路径\n- chore: 更新版本号并修改相关配置文件\n- chore: 更新版本号并修改相关配置文件\n- feat: 实现下载功能，支持从内存和文件下载，添加下载进度回调和错误处理\n- feat: 添加文件和目录的默认应用打开功能，更新更新检查器以支持下载和安装更新\n- 更新了打开安装程序\n- feat: add HTTP plugin support and file download functionality\n- chore: 更新版本号并修改相关配置文件\n- 0.1.12\n- chore: 更新版本号并修改相关配置文件\n- chore: 更新 tauri 配置文件格式至 json5，并同步版本号\n- chore: 更新版本号至 0.1.10，并修改相关配置文件\n- 0.1.11\n- chore: 更新版本号并修改相关配置文件\n- 0.1.6\n- chore: 更新版本号至 ${npm_package_version} 并修改相关配置文件\n- chore: 更新版本号至 0.1.10，并修改相关配置文件\n- 0.1.10\n- chore: 更新版本号至 0.1.9 并修改更新说明",
  "pub_date": "2025-06-25T12:58:13.082Z",
  "platforms": {
    "windows-x86_64": {
      "signature": "dW50cnVzdGVkIGNvbW1lbnQ6IG1pbmlzaWduIHB1YmxpYyBrZXk6IDJENTM1QTc0QzVENkREODkKUldTSjNkYkZkRnBUTFlKcURFREtqT3dFVC9NUlluKzlGYlZBWFBLYlgxYjBFVXllanEwazZmeE0K",
      "url": "https://github.com/XiaoLinXiaoZhu/XX-Mod-Manager-V2/releases/download/v0.2.0/xx-mod-manager-tauri_0.2.0_x64-setup.exe"
    }
  }
}