{
  "message": {
    "hello": "Hello, World",
    "alert": {
      "emptyModSourceOrTarget": "mod destination folder or mod source folder is empty"
    },
    "requireRefresh": "Program needs to be refreshed to apply changes"
  },
  "element": {
    "section": {
      "mod": "Mod",
      "help": "Help",
      "settings": "Settings",
      "intro": "Intro",
      "basic": "Basics",
      "advanced": "Advanced",
      "auto": "Auto",
      "more": "More"
    },
    "filter": {
      "all": "All",
      "selected": "Selected"
    }
  },
  "setting-tab": {
    "normal": "General Settings",
    "advanced": "Advanced Settings",
    "switch-config": "Switch Configuration",
    "about": "About",
    "plugin": "Plugin"
  },
  "setting": {
    "title": "Settings",
    "language": "Language",
    "theme": "Theme",
    "auto": "Auto",
    "dark": "Dark",
    "light": "Light",
    "system": "System",
    "reset": "Reset",
    "unavailable": "In development, the following features are temporarily unavailable",
    "auto-apply": "Auto Apply",
    "modTargetPath": "Mod Target Folder",
    "modTargetPath-info": "The mod target directory is where modLoader reads mods, usually the Mods folder",
    "modSourcePath": "Mod Source Folder",
    "modSourcePath-info": "The mod source directory is where the program stores mods. When a mod is enabled, a link will be created from here to the mod target directory",
    "presetPath": "Preset Folder",
    "presetPath-info": "The preset path is where presets are stored. A preset is a collection of mods that can be enabled with one click",
    "movedToPlugin": "The following functions are moved to plugins to continue to be provided",
    "managePlugin": "Plug-in management",
    "pluginList": "Plugin list",
    "showDetail": "show configuration",
    "pluginListInfo": "After closing the plugin, the plugin will not be loaded the next time it is loaded."
  },
  "modInfo": {
    "emptyTitle": "Click on a mod card to view detailed information",
    "emptyCharacter": "No Character",
    "emptyDescription": "No Description",
    "hotkeys": "Hotkeys",
    "description": "Description",
    "edit": "Edit information",
    "openUrl": "Open mod link",
    "openFolder": "open folder"
  },
  "editDialog": {
    "edit-mod-info": "Edit MOD Info",
    "mod-info-name-tip": "The Mod name is the folder name, click the button to go to the folder to modify",
    "mod-info-character-tip": "The character name is the character name in the mod, the program classifies and displays according to this name, of course, it is not necessarily the character name, it can also be other classification names, such as 'tools', 'mise', etc.",
    "mod-info-image-tip": "The MOD cover is used to display the mod, click the button to select the cover image",
    "mod-info-url-tip": "Used to record the source address of the mod, convenient for tracking updates and sharing",
    "mod-info-hotkeys-tip": "Hotkeys supported by the mod, used to switch the mod status",
    "mod-info-description-tip": "The MOD description is used to describe the mod, which can be used to record the author, version, etc.",
    "mod-info-name": "MOD Name",
    "mod-info-character": "Character",
    "mod-info-image": "MOD Cover",
    "mod-info-url": "MOD Source URL",
    "mod-info-hotkeys": "Hotkeys",
    "mod-info-description": "MOD Description",
    "edit-mod-image-preview": "Select MOD Cover",
    "mod-info-hotkeys-hotkey": "Hotkey",
    "mod-info-hotkeys-description": "Hotkey Description",
    "edit-mod-hotkeys": "Edit Hotkeys",
    "save": "Save",
    "cancel": "Cancel",
    "ignore": "Ignore",
    "changeNotSave": "Unsaved changes detected",
    "ifSaveChange": "Save changes?",
    "batch-operation": "Batch operation"
  },
  "buttons": {
    "addPreset": "Add preset",
    "apply": "Apply",
    "cancel": "Cancel",
    "compactMode": "compact mode",
    "edit": "edit",
    "managePreset": "Manage presets",
    "reset": "reset",
    "save": "save",
    "clickToClose": "Click to close",
    "forePage": "Next page",
    "nextPage": "Previous page",
    "confirm": "confirm",
    "refresh": "refresh",
    "all": "All",
    "selected": "Selected"
  },
  "author": "author",
  "caimogu": "Caimogu",
  "firstLoad": {
    "Introduction": "This is a mod manager for managing 3dmigoto based mods. \nIt has powerful functions and a beautiful interface, allowing you to manage mods more conveniently.",
    "aboutProgram": "About this program",
    "aboutProgramInfo": "This program is developed by XLXZ, is open source and free, and follows the GNU General Public License v3.0. \nUsed to manage mods based on 3dmigoto. In theory, it can also manage mods of other games (as long as they are based on 3dmigoto)",
    "aboutProgramInfo-1": "The latest version is released on gamebanana. If you have any questions or suggestions, please submit them on github.",
    "aboutProgramPrinciple": "Operating principle",
    "aboutProgramPrincipleInfo": "This program implements mod loading by proxying the Mods folder, and dynamically adjusts the files inside the mod folder to implement mod loading.",
    "advancedIntro": "It's almost ready. Let's make some settings and let XXMM proxy your Mods folder.",
    "advancedIntro-1": "Please set the mod target folder, mod source folder and default folder",
    "advancedIntro-2": "If you don't know what these are, please go back to the previous page to check",
    "alertFolder": "Please note that the following three folders cannot be the same, otherwise the program will not run properly.",
    "alertPreset": "This folder path is also required. If not set, the program will not run properly.",
    "autoInfo-1": "This program supports functions such as automatically starting the game, automatically applying mods, automatically refreshing applied mods, etc. You can set them in the settings.",
    "autoInfo-2": "You can also install plugins for the program to achieve more functions",
    "autoMove": "Move all files under mod target to mod source",
    "autoSetting": "Automation settings",
    "congratulate": "Congratulations on setting up",
    "congratulate-1": "You have completed the configuration and can now start using this program. Please close this page.",
    "explanation": "Before using it, let us explain some terms",
    "huan-ying-shi-yong-xxmodmanagerxxmm": "Welcome to XX-mod-manager(XXMM)",
    "modPresetPathInfo": "This is the folder used by this program to store mod presets. The program will store a set of mod configurations here. After the configuration, you will quickly switch between different mod combinations through the preset function. \nIt should be set to an empty folder anywhere",
    "modSourcePathInfo": "This is the folder where this program reads mods, and the folder where you should store mods. \nIt should be set to an empty folder anywhere, you will then need to add your mod to this folder",
    "modTargetPathInfo-1": "This is the folder actually loaded by your module loader. For ZZMI, it is the ZZMI Mods folder; for XXMI, it is the XXMI internal folder /zzz/Mods.",
    "modTargetPathInfo-2": "This program implements mod loading by proxying the Mods folder, and dynamically adjusts the files inside the mod folder to implement mod loading, so please do not add any files in the mod target folder! \nJust add your mod to the mod source folder.",
    "prerequisites": "Prerequisites",
    "prerequisites-1": "Please make sure you have 3dmigoto or other mod loader installed and running successfully. \nIf you haven't installed 3dmigoto yet, please install 3dmigoto first. \nIf you don't understand what 3dmigoto is, please search it yourself.",
    "prerequisites-2": "Please note that this program is only a mod manager, not a mod loader. It needs to rely on 3dmigoto or other mod loaders to load mods.",
    "selectLanguageAndTheme": "Select your language and theme below",
    "thanks": "special thanks",
    "themeRecommand": " Dark theme recommended. When designing, I paid more attention to the aesthetics of the dark theme, which imitated the design style of ZZZ.",
    "whatCanIt": "What functions does it have?",
    "whatCanIt-1": "Intuitively manage mods through visual cards",
    "whatCanIt-2": "Modify the information of your mods with a right click",
    "whatCanIt-3": "Quickly switch through different mods by setting presets",
    "whatCanIt-4": "By setting the automation function to achieve full automation from opening 3dmigoto to starting the game to automatically refreshing the application mod",
    "whatIsThis": "What's this?",
    "switchConfig": "Select the [Save configuration as] path and click Create shortcut to create a configuration item on the desktop that uses a local path instead of a global path, so that it can be applied to multiple games\nAfter that, click the desktop shortcut to start xxmm using local configuration",
    "switchConfigInfo1": "Enter the [Configuration Name] and click [Add Configuration] to create a [Configuration Folder] in the [Global Configuration Folder] to store your configuration. After that, you can click to open the [Configuration Switch Page] to quickly switch configurations.\n\n-\n\nYou can configure the switch configuration page to be opened first every time you open it, and the unconventional page is easy to use for different games.",
    "switchConfigTitle1": "# Add a new configuration in the global config folder",
    "switchConfigInfo2": "# Convenient tool\n\nMany times, you may want to open XXMM directly through different desktop shortcuts, rather than open XXMM and manually choose which config to use. This can be very useful.\n\nClick 'Open Global Config Folder', find the folder for which you want to create a shortcut, select it as the target for 'Save Configuration As', then click 'Create Shortcut'. This will place a shortcut on the desktop that uses the configuration in that folder, allowing you to open XXMM directly with that config."
  },
  "gamebanana": "Gamebanana",
  "github": "Github",
  "presetDialog": {
    "emptyName": "Preset name cannot be empty",
    "name": "Preset name",
    "nameExist": "Default name already exists",
    "requireName": "Please enter the preset name",
    "success": "Preset added successfully"
  },
  "mod-image": "Mod Image",
  "no-mod-selected": "No mod selected",
  "dialogEnterPassword": {
    "title": "Please Enter Password",
    "cancel": "Cancel entering password and exit decompression",
    "confirm": "Confirm Password:"
  }
}
